Revit 2024 API
View.AreAnalyticalModelCategoriesHidden Property
 Indicates if analytical model categories are currently hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool AreAnalyticalModelCategoriesHidden { get; set; }
Visual Basic
Public Property AreAnalyticalModelCategoriesHidden As Boolean
	Get
	Set
Visual C++
public:
property bool AreAnalyticalModelCategoriesHidden {
	bool get ();
	void set (bool value);
}
Field Value
 True if analytical model categories are currently hidden in the view, false otherwise.
See Also
View Class
Autodesk.Revit.DB Namespace